function duplicationCount(text){
    let count = 0;
}

console.log(duplicationCount('indivisibility'));

/**
 *  1. Задача - Функция, которая подсчитывает количество
 *  буквенных или числовых символов, которые повторяются
 *  более одного раза в строке
 *  2. План действий
 *  если нам нужно подсчитать количество чего либо, значит
 *  это значение надо хранить, создаем переменную
 *  дальше мне надо взять первый символ в строке и сравнить
 *  его с остальными в строке, если такой же существует,
 *  значит к count надо добавить 1;
 *  
 */ 